{
  "backend/main.mo": "Main Motoko actor for the technical support platform, defining data types and state for tickets, knowledge base articles, chat messages, user profiles, payments, and access control, along with initialization and role-assignment functions.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles (LoginPrompt headline/description updates, skills/pricing/testimonials sections, etc.) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing one- to two-sentence summaries of every frontend source file, serving as a quick reference for the purpose and key changes in each component, hook, and stylesheet.",
  "frontend/index.html": "Minimal HTML entry point that sets the page title to 'Technical Support Platform' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with routes for index, customer/expert login, knowledge base, and payment success pages, wrapping everything in QueryClientProvider, ThemeProvider, and a shared Layout with Header, Footer, and floating chat buttons.",
  "frontend/src/components/AdminLoginTracking.tsx": "Admin dashboard component that displays a table of user login events fetched from the backend and provides a CSV export/download feature with toast notifications.",
  "frontend/src/components/AgentPerformanceTable.tsx": "Displays a table of technician agents with their online/offline status and estimated tickets handled, calculated from resolved ticket counts divided across agents.",
  "frontend/src/components/AIAssistantChat.tsx": "AI assistant chat component with a local knowledge base of IT troubleshooting responses (printer, BSOD, slow computer, password, Wi-Fi, network, email) that matches user queries and supports handover to a live technician.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Renders an analytics overview with metric cards (total, open, resolved tickets, resolution rate), ticket volume and priority charts, and an agent performance table using data from analytics and technician hooks.",
  "frontend/src/components/ChatFeedbackDialog.tsx": "A modal dialog that lets users rate their support session on a 1–10 slider and optionally add a comment, then submits the feedback and shows a thank-you confirmation.",
  "frontend/src/components/ChatSection.tsx": "Chat interface for support tickets that allows users and technicians to view and send messages per ticket, manage technician availability, and toggle payment state, with auto-scroll and optimistic UI sync.",
  "frontend/src/components/ClientPortal.tsx": "Customer-facing portal with tabs for viewing support tickets, service history, and subscription plans, plus a dialog for creating new tickets.",
  "frontend/src/components/CustomerDashboard.tsx": "Customer-facing dashboard with tabbed navigation for Live Chat, My Portal, Knowledge Base, and Payments. Includes a PaymentModalController that polls for technician-triggered payment requests and shows a modal to the customer.",
  "frontend/src/components/CustomerLogin.tsx": "Customer login page using Internet Identity authentication, with a two-column layout showing branding/imagery and a login card. Redirects to home on successful login.",
  "frontend/src/components/ExpertDashboard.tsx": "Expert/technician dashboard with tabbed navigation for Live Chat, Tickets, Analytics, Knowledge Base, and Admin login tracking. Each tab renders a dedicated section component.",
  "frontend/src/components/ExpertLogin.tsx": "Expert login page using Internet Identity authentication, styled with a violet theme and two-column layout. Redirects to home after successful login.",
  "frontend/src/components/ExpertProfileCard.tsx": "Displays a technician's profile card with avatar, display name, role, and online/offline status badge.",
  "frontend/src/components/FloatingAIChatButton.tsx": "Fixed floating button in the bottom-left corner that toggles an AI assistant chat panel overlay with a pulsing animation.",
  "frontend/src/components/FloatingChatButton.tsx": "Fixed floating chat button in the bottom-right corner that shows a proactive chat invitation after 8 seconds and navigates to the home/chat route on acceptance.",
  "frontend/src/components/Footer.tsx": "Site footer displaying a support email address and a 'Built with caffeine.ai' attribution with the current year.",
  "frontend/src/components/Header.tsx": "Sticky app header with logo, Knowledge Base nav link, light/dark theme toggle, and Internet Identity login/logout button.",
  "frontend/src/components/KBArticleDetail.tsx": "Displays a single knowledge base article with metadata (category, views, date, tags), increments view count on mount, and provides admin edit/delete controls.",
  "frontend/src/components/KBArticleEditor.tsx": "Form component for creating or editing a knowledge base article, with fields for title, category, body, and tags, using create/update mutation hooks.",
  "frontend/src/components/KnowledgeBaseView.tsx": "Main knowledge base page that lists articles with search and category filtering, and handles navigation to article detail or editor views.",
  "frontend/src/components/LoginPrompt.tsx": "Marketing landing page shown to unauthenticated users, featuring a hero banner, service skills, pricing tiers, testimonials, and a portfolio section.",
  "frontend/src/components/MainContent.tsx": "Routes authenticated users to either the CustomerDashboard or ExpertDashboard based on their profile's isTechnician flag.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component that displays a labeled metric value with an optional icon, subtitle, and up/down/neutral trend indicator.",
  "frontend/src/components/OfflineContactForm.tsx": "A form component displayed when all support experts are offline, allowing users to submit their name, email, and message, with a success confirmation state after submission.",
  "frontend/src/components/OpenTicketsByPriorityChart.tsx": "A bar chart component that visualizes open support tickets distributed across Low, Medium, High, and Critical priority levels using Recharts.",
  "frontend/src/components/PaymentRequestModal.tsx": "A modal dialog that handles PayU payment initiation for a support session, generating a hash from the backend and submitting a payment form when the user clicks Pay Now.",
  "frontend/src/components/PaymentSection.tsx": "A payment UI section that checks Stripe configuration status and either shows a 'not configured' alert or renders a styled card with a button to create a Stripe checkout session.",
  "frontend/src/components/PreChatForm.tsx": "A dialog form that collects a user's name, email, and issue topic before starting a support chat, with inline validation and a loading state on submission.",
  "frontend/src/components/ProactiveChatInvitation.tsx": "A small animated invitation widget that prompts the user to start a chat with an online support expert, offering Accept and Dismiss actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for new users to enter their display name and save their profile via the `useSaveCallerUserProfile` mutation. Validates input and calls `onComplete` on success.",
  "frontend/src/components/ServiceHistoryTimeline.tsx": "Renders a vertical timeline of resolved support tickets sorted by most recently updated, including star ratings and comments from feedback. Shows an empty state when no resolved tickets exist.",
  "frontend/src/components/SLAIndicator.tsx": "Displays a live countdown to an SLA due timestamp, updating every minute and showing warning or breached states. Supports compact (badge) and full display modes.",
  "frontend/src/components/TicketCreationForm.tsx": "A form for creating a new support ticket by selecting an available technician and providing a title, description, and priority. Submits via a mutation calling `actor.createSupportTicket` and invalidates the userTickets query on success.",
  "frontend/src/components/TicketDetailView.tsx": "Displays detailed information for a single support ticket and allows technicians to update its status via a dropdown. Shows ticket metadata, timestamps, and a status badge with color coding.",
  "frontend/src/components/TicketListView.tsx": "Lists support tickets for either the current user or all tickets (admin mode), with status filtering and click-through to a detail view loaded by ticket ID. Handles loading and error states.",
  "frontend/src/components/TicketVolumeChart.tsx": "Renders a Recharts line chart showing mock daily ticket volume over the last 30 days, derived from a total ticket count. Wrapped in a Card with a responsive container.",
  "frontend/src/components/TypingIndicator.tsx": "Renders an animated three-dot typing indicator using bouncing circles with staggered animation delays.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom hook that fetches analytics metrics (total, open, resolved tickets, resolution rate) from the backend actor, polling every 30 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useKnowledgeBase.ts": "Collection of React Query hooks for CRUD operations on knowledge base articles, including fetching, searching, filtering by category, creating, updating, deleting, and incrementing view counts.",
  "frontend/src/hooks/usePaymentToggle.ts": "Hooks for fetching and mutating payment toggle state per ticket, with 5-second polling to detect real-time changes on the customer side.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, login events, chat messages, support tickets, and shopping items, with aggressive polling for real-time message updates.",
  "frontend/src/hooks/useTickets.ts": "React Query hooks for fetching user and admin support tickets, retrieving a single ticket, and updating ticket status, with periodic polling.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind CSS base layers, CSS custom properties for a teal/indigo/amber design system with full light and dark mode token sets, and base typography using Inter and Poppins fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based color tokens, border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state manifest (version 19) describing an IT helpdesk app with ticketing, live chat, knowledge base, and client portal features, including architectural notes, known issues, image requirements, and a list of existing and planned features."
}