{
  "backend/main.mo": "Main Motoko actor for the technical support platform, defining data types (Ticket, KBArticle, KBComment, etc.) and state maps for tickets, messages, users, payments, and chat, with functions for access control, ticketing, knowledge base, chat, and Stripe payment integration.",
  "backend/migration.mo": "Defines OldActor and NewActor type shapes and a `run` migration function to carry state forward during canister upgrades, preserving all existing data maps and counters.",
  "feature_evidence.json": "A feature evidence report mapping implemented features (ticketing system, AI assistant chat, knowledge base, etc.) to their relevant frontend/backend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of every frontend source file, serving as a reference document for the project's frontend structure.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads the TypeScript module entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with routes for home, customer/expert login, knowledge base, and payment pages, wrapping everything in QueryClientProvider and ThemeProvider with lazy-loaded page components.",
  "frontend/src/components/AdminLoginTracking.tsx": "An admin dashboard component that displays a table of user login events fetched from the backend and allows exporting the data as a CSV file. Shows role-colored badges, timestamps, and total login count.",
  "frontend/src/components/AgentPerformanceTable.tsx": "A table component that displays technician agents with their online/offline status and estimated tickets handled, calculated by evenly distributing resolved tickets across available technicians.",
  "frontend/src/components/AIAssistantChat.tsx": "A React chat component that provides an AI-powered IT support assistant with a built-in knowledge base covering common issues like printers, BSOD, slow computers, passwords, and Wi-Fi. Supports message history, keyword-based responses, and a handover option to a live technician.",
  "frontend/src/components/AnalyticsDashboard.tsx": "A dashboard component that aggregates and displays support ticket analytics including total, open, and resolved ticket counts plus resolution rate, rendered via metric cards, charts, and an agent performance table.",
  "frontend/src/components/ChatFeedbackDialog.tsx": "A modal dialog that collects a 1–10 star rating and optional comment from users after a support chat session, then submits the feedback via a provided async callback.",
  "frontend/src/components/ChatSection.tsx": "A chat interface component for both customers and technicians that displays ticket-scoped message threads, supports sending messages, and allows technicians to toggle their availability status.",
  "frontend/src/components/ClientPortal.tsx": "A tabbed client portal component that lets users view/create support tickets, browse service history, and compare subscription plans (Basic, Premium, Enterprise).",
  "frontend/src/components/CustomerDashboard.tsx": "Top-level customer dashboard with four tabs: Chat, Client Portal, Knowledge Base, and Payment, using lazy loading for the AI assistant.",
  "frontend/src/components/CustomerLogin.tsx": "Customer login page using Internet Identity authentication, redirecting to home on success and displaying feature highlights with a branded layout.",
  "frontend/src/components/ExpertDashboard.tsx": "Expert/technician dashboard with tabs for Chat, Tickets, Analytics, Knowledge Base, and an admin-only user tracking panel.",
  "frontend/src/components/ExpertLogin.tsx": "Expert login page using Internet Identity, styled with a violet theme and showing support-focused feature highlights before redirecting on success.",
  "frontend/src/components/ExpertProfileCard.tsx": "Displays a support expert's avatar, display name, role, and online/offline status as a card component.",
  "frontend/src/components/FloatingAIChatButton.tsx": "A fixed floating button that toggles a lazily-loaded AI assistant chat panel, with a pulsing animation and an AI badge.",
  "frontend/src/components/FloatingChatButton.tsx": "A fixed floating chat button component that shows a proactive chat invitation after 10 seconds of user inactivity, navigates unauthenticated users to login, and is hidden for technician profiles.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a support email link and a copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "A sticky header with the app logo, navigation links, a dark/light theme toggle, and an Internet Identity login/logout button.",
  "frontend/src/components/KBArticleDetail.tsx": "Displays the full content of a knowledge base article including metadata (views, date, tags), increments the view count on mount, and provides admin edit/delete controls.",
  "frontend/src/components/KBArticleEditor.tsx": "A form component for creating or editing knowledge base articles with fields for title, category, body, and tags, using create/update mutation hooks.",
  "frontend/src/components/KnowledgeBaseView.tsx": "A knowledge base listing view with debounced search, category filtering, and navigation to article detail or editor views; supports an admin mode for creating and editing articles.",
  "frontend/src/components/LoginPrompt.tsx": "Landing page shown to unauthenticated users, featuring a hero image, feature highlights (chat, AI assistant, payment, support), and a login/signup call-to-action for PKG Tech Support.",
  "frontend/src/components/MainContent.tsx": "Routes authenticated users to either the ExpertDashboard or CustomerDashboard based on whether their profile indicates they are a technician.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component that displays a labeled metric value with an optional subtitle, icon, and trend indicator (up/down/neutral).",
  "frontend/src/components/OfflineContactForm.tsx": "Form displayed when no experts are online, allowing users to submit their name, email, topic, and message for an async follow-up response.",
  "frontend/src/components/OpenTicketsByPriorityChart.tsx": "Bar chart component that visualizes open support tickets distributed across Low, Medium, High, and Critical priority levels using Recharts.",
  "frontend/src/components/PaymentSection.tsx": "Handles Stripe-based support payment flow, showing a loading state, a disabled placeholder if Stripe is unconfigured, or a checkout button that redirects to a Stripe session.",
  "frontend/src/components/PreChatForm.tsx": "Modal dialog that collects a user's name, email, and support topic before initiating a live chat session with an expert.",
  "frontend/src/components/ProactiveChatInvitation.tsx": "Small animated card widget that proactively invites the user to start a chat, with accept and dismiss actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's display name, email, and role (customer or technician) and saves the profile via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/ServiceHistoryTimeline.tsx": "Renders a vertical timeline of resolved support tickets sorted by most recently updated, including star ratings and comments from ticket feedback.",
  "frontend/src/components/SLAIndicator.tsx": "Displays a live countdown to an SLA due timestamp, updating every minute and showing warning or breached states via colored badges or banners.",
  "frontend/src/components/TicketCreationForm.tsx": "A form for creating a new support ticket with title, description, priority, and technician selection, submitting via a React Query mutation that calls the backend actor.",
  "frontend/src/components/TicketDetailView.tsx": "Shows detailed information for a single support ticket including participants and timestamps, and allows technicians or participants to update the ticket status.",
  "frontend/src/components/TicketListView.tsx": "Displays a filterable list of support tickets as cards with color-coded status indicators, supporting selection and loading skeleton states.",
  "frontend/src/components/TicketVolumeChart.tsx": "Renders a Recharts line chart showing mock daily ticket volume over the last 30 days, derived from a provided total ticket count.",
  "frontend/src/components/TypingIndicator.tsx": "Renders an animated three-dot typing indicator using bouncing circles with staggered animation delays.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom hook that fetches analytics metrics (total, open, resolved tickets and resolution rate) from the backend actor, polling every 30 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useKnowledgeBase.ts": "Collection of React Query hooks for CRUD operations on knowledge base articles, including fetching, searching, filtering by category, creating, updating, deleting, and incrementing view counts.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, login events, chat messages, and support tickets, including real-time polling for messages and mutations for sending/marking messages.",
  "frontend/src/hooks/useTickets.ts": "React Query hooks for fetching user and admin support tickets (with polling) and a mutation hook for updating ticket status.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, an OKLCH-based CSS variable color system for light and dark modes, custom scrollbar styles, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radius, box shadow, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 5) describing an IT helpdesk application with ticketing, live chat AI bot, knowledge base, client portal, and analytics features, along with architectural notes and existing feature definitions."
}