{
  "backend/main.mo": "Main Motoko actor defining all backend types, state maps, and shared functions for a technical support platform including tickets, knowledge base articles, chat messages, user profiles, payments (Stripe), and access control.",
  "backend/migration.mo": "Trivial migration module that passes state through unchanged, serving as a no-op migration runner.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to the frontend files and components involved, with test IDs and confidence levels for each planned change.",
  "frontend-file-summaries.txt": "Pre-generated one- to two-sentence summaries of each frontend source file, describing their roles and key implementation details.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app using TanStack Router with routes for index, customer/expert login, knowledge base, and payment success/cancel pages, wrapping everything in QueryClientProvider and ThemeProvider.",
  "frontend/src/components/AdminLoginTracking.tsx": "Admin dashboard component that displays a table of user login events fetched from the backend and provides a CSV export/download feature with toast notifications.",
  "frontend/src/components/AgentPerformanceTable.tsx": "Renders a table showing technician agents with their online/offline status and estimated tickets handled, calculated by evenly distributing resolved tickets across agents.",
  "frontend/src/components/AIAssistantChat.tsx": "Client-side AI chat component that matches user messages against a local IT knowledge base dictionary and returns canned troubleshooting responses, with an option to hand off to a live technician.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Composes the analytics view with metric cards (total, open, resolved tickets, resolution rate), ticket volume and priority charts, and the agent performance table using data from analytics and technician hooks.",
  "frontend/src/components/ChatFeedbackDialog.tsx": "Modal dialog that lets users rate their support session on a 1–10 slider with an optional comment, then submits the feedback and shows a thank-you confirmation.",
  "frontend/src/components/ChatSection.tsx": "Chat interface for a support ticket that displays messages, handles sending new messages, marks messages as read, and lets technicians toggle a payment request modal.",
  "frontend/src/components/ClientPortal.tsx": "Customer-facing portal with tabs for viewing tickets, service history, and support plans, plus a dialog for creating new tickets.",
  "frontend/src/components/CustomerDashboard.tsx": "Main customer dashboard with tabbed navigation for Portal, Chat, Knowledge Base, and Payment sections. Includes a PaymentModalController that polls the active ticket's payment toggle and shows a payment request modal when enabled by a technician.",
  "frontend/src/components/CustomerLogin.tsx": "Customer login page using Internet Identity authentication, with a two-column layout featuring branding imagery and a login card. Redirects to home on successful login and shows toast notifications for errors.",
  "frontend/src/components/ExpertDashboard.tsx": "Expert dashboard with tabbed navigation for Chat, Tickets, Analytics, Knowledge Base, Admin tracking, and History. Includes an ExpertHistorySection that displays resolved tickets in a timeline view with loading and empty states.",
  "frontend/src/components/ExpertLogin.tsx": "Expert/technician login page using Internet Identity, with a violet-themed two-column layout showing branding and a login card. Redirects to home after successful authentication.",
  "frontend/src/components/ExpertProfileCard.tsx": "Displays an expert's profile card with avatar, display name, role, and online/offline status badge. Shows a green indicator dot on the avatar when the expert is online.",
  "frontend/src/components/FloatingAIChatButton.tsx": "Floating action button fixed to the bottom-left that toggles an AI assistant chat panel. The panel includes a header with a close button and renders the AIAssistantChat component in a scrollable container.",
  "frontend/src/components/FloatingChatButton.tsx": "Floating chat button fixed to the bottom-right that shows a proactive chat invitation after 8 seconds and navigates to home on acceptance. Toggles an open/close state with a pulsing animation ring.",
  "frontend/src/components/Footer.tsx": "Site footer displaying a support email address and a copyright notice with a caffeine.ai attribution link. Uses a gradient background and includes heart and mail icons.",
  "frontend/src/components/Header.tsx": "Sticky app header with logo, Knowledge Base nav link, dark/light theme toggle, and Internet Identity login/logout button.",
  "frontend/src/components/KBArticleDetail.tsx": "Displays a single knowledge base article with metadata (category, views, date, tags), increments view count on mount, and provides admin edit/delete controls.",
  "frontend/src/components/KBArticleEditor.tsx": "Form component for creating or editing a knowledge base article, with fields for title, category, body, and tags, wired to create/update mutation hooks.",
  "frontend/src/components/KnowledgeBaseView.tsx": "Main knowledge base page that lists articles with search and category filtering, and conditionally renders the article detail view or editor for admins.",
  "frontend/src/components/LoginPrompt.tsx": "Public landing page showcasing PKG Tech Support services, pricing tiers, testimonials, and a portfolio section, with a call-to-action to navigate to login.",
  "frontend/src/components/MainContent.tsx": "Routes authenticated users to either the CustomerDashboard or ExpertDashboard based on their profile's isTechnician flag.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component that displays a labeled metric value with an optional icon, subtitle, and up/down/neutral trend indicator.",
  "frontend/src/components/OfflineContactForm.tsx": "A form component displayed when all support experts are offline, allowing users to submit their name, email, and message, with a success confirmation state after submission.",
  "frontend/src/components/OpenTicketsByPriorityChart.tsx": "A bar chart card that visualizes open support tickets distributed across Low, Medium, High, and Critical priority levels, derived from the total open ticket count.",
  "frontend/src/components/PaymentRequestModal.tsx": "A modal dialog that presents a payment request from a technician, supporting UPI/QR and card payment methods, with a confirmation state after payment is completed.",
  "frontend/src/components/PaymentSection.tsx": "A payment UI section that checks Stripe configuration and either shows a 'not configured' alert or renders a styled checkout card that redirects users to a Stripe checkout session.",
  "frontend/src/components/PreChatForm.tsx": "A dialog form that collects a user's name, email, and issue topic before starting a support chat, with inline validation and a loading state on submission.",
  "frontend/src/components/ProactiveChatInvitation.tsx": "A small animated invitation widget that prompts users to start a chat with an online support expert, offering accept and dismiss actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their display name and saves their profile via the `useSaveCallerUserProfile` hook before calling `onComplete`.",
  "frontend/src/components/ServiceHistoryTimeline.tsx": "Renders a vertical timeline of the customer's resolved support tickets fetched via `useGetCustomerHistory`, with loading skeletons and empty/error states.",
  "frontend/src/components/SLAIndicator.tsx": "Displays a live countdown to an SLA due timestamp, showing warning or breached states with appropriate styling in either compact badge or full row format.",
  "frontend/src/components/TicketCreationForm.tsx": "A form that lets a user select an available technician and submit a new support ticket via `useCreateSupportTicket`, with error handling for payment, rate-limit, and availability issues.",
  "frontend/src/components/TicketDetailView.tsx": "Shows detailed information for a single support ticket and allows technicians to update its status via a dropdown, using `useUpdateTicketStatus`.",
  "frontend/src/components/TicketListView.tsx": "Lists support tickets (user-owned or all admin tickets) with status filtering, and navigates to a `TicketDetailView` by lazily fetching the selected ticket via `useGetTicket`.",
  "frontend/src/components/TicketVolumeChart.tsx": "Renders a Recharts line chart card showing daily ticket volume over the last 30 days, using mock data generated from a total ticket count prop.",
  "frontend/src/components/TypingIndicator.tsx": "Displays an animated three-dot typing indicator using staggered bounce animations to indicate a pending response.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Provides a React Query hook to fetch analytics metrics (total, open, resolved tickets, resolution rate) from the backend actor, refreshing every 30 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status to child components.",
  "frontend/src/hooks/useKnowledgeBase.ts": "Exports React Query hooks for CRUD operations on knowledge base articles, including fetching, searching, filtering by category, creating, updating, deleting, and incrementing view counts.",
  "frontend/src/hooks/usePaymentToggle.ts": "Provides React Query hooks to get and set payment toggle state (both transient and persistent) for a given ticket, polling every 5 seconds.",
  "frontend/src/hooks/useQueries.ts": "Aggregates React Query hooks for user profile management, admin checks, technician availability, and chat message operations against the backend actor.",
  "frontend/src/hooks/useTickets.ts": "Exports React Query hooks for fetching user and admin support tickets, retrieving a single ticket, updating ticket status, and creating new support tickets.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, sets up Tailwind directives, and defines CSS custom properties for a full light/dark theme system using oklch colors (primary teal, secondary indigo, accent amber, etc.).",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider (React Query) and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them to sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom CSS-variable-based colors, Inter/Poppins font families, border radii, box shadows, and accordion/pulse-ring keyframe animations; includes tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Project state metadata (version 3) for the TechSupport Platform, documenting five existing fix features covering payment UI removal, payment modal fix, customer/expert history display bugs, and a deployment build error."
}