{
  "backend/main.mo": "Main Motoko actor for the technical support platform, defining data types and state for tickets, KB articles, chat messages, user profiles, payments, and access control. Includes initialization of counters, maps, and Stripe configuration alongside shared/query functions for managing all platform entities.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, affected files, component dependencies, and test IDs for the technical support platform. Covers fixes for chat message history, customer reply functionality, and payment gate removal from ticket creation.",
  "frontend-file-summaries.txt": "JSON document providing one-to-two sentence summaries of each frontend source file, describing the purpose and key implementation details of components, hooks, and styles in the React frontend.",
  "frontend/index.html": "Minimal HTML entry point for the React frontend, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with routes for home, customer/expert login, knowledge base, and payment success, wrapping everything in QueryClientProvider and ThemeProvider. The IndexPage component handles authentication state to conditionally render LoginPrompt, ProfileSetupModal, or MainContent.",
  "frontend/src/components/AdminLoginTracking.tsx": "Admin dashboard component that displays a table of user login events fetched from the backend and provides a CSV export/download feature with toast notifications.",
  "frontend/src/components/AgentPerformanceTable.tsx": "Displays a table of technician agents with their online/offline status and estimated tickets handled, calculated from resolved ticket counts divided across agents.",
  "frontend/src/components/AIAssistantChat.tsx": "AI assistant chat component with a local IT knowledge base that matches user queries to predefined troubleshooting guides for topics like printers, BSOD, Wi-Fi, and passwords. Provides a chat UI with message history, a handover-to-human option, and auto-scroll behavior.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Renders an analytics overview with metric cards (total, open, resolved tickets, resolution rate), ticket volume and priority charts, and an agent performance table using data from analytics and technician hooks.",
  "frontend/src/components/ChatFeedbackDialog.tsx": "A modal dialog that lets users rate their support session on a 1–10 slider and optionally add a comment, then submits the feedback and shows a thank-you confirmation.",
  "frontend/src/components/ChatSection.tsx": "Chat interface component that lists user tickets, displays per-ticket messages with auto-scroll, supports sending messages, and allows technicians to toggle their availability status.",
  "frontend/src/components/ClientPortal.tsx": "Customer-facing portal with tabs for viewing tickets, service history, and support plans, including a dialog for creating new support tickets.",
  "frontend/src/components/CustomerDashboard.tsx": "Renders the customer-facing dashboard with four tabs: Live Chat, My Portal, Knowledge Base, and Payment, each loading a corresponding section component.",
  "frontend/src/components/CustomerLogin.tsx": "Provides the customer login page using Internet Identity authentication, redirecting to home on success and displaying feature highlights alongside a login card.",
  "frontend/src/components/ExpertDashboard.tsx": "Renders the expert/admin dashboard with five tabs: Live Chat, Tickets, Analytics, Knowledge Base, and Admin login tracking.",
  "frontend/src/components/ExpertLogin.tsx": "Provides the expert login page using Internet Identity authentication, with a violet-themed layout showing support feature highlights and redirecting home on success.",
  "frontend/src/components/ExpertProfileCard.tsx": "Displays a compact card showing an expert's avatar, display name, role, and online/offline status badge.",
  "frontend/src/components/FloatingAIChatButton.tsx": "Renders a fixed floating button that toggles an AI assistant chat panel overlay in the bottom-left corner of the screen.",
  "frontend/src/components/FloatingChatButton.tsx": "Renders a fixed floating chat button in the bottom-right corner that shows a proactive chat invitation after 8 seconds and toggles an open state on click.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with a support email link and a caffeine.ai attribution credit.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, Knowledge Base link, theme toggle (light/dark), and Internet Identity login/logout button.",
  "frontend/src/components/KBArticleDetail.tsx": "Displays a single knowledge base article with metadata (views, date, tags) and admin controls for editing or deleting the article.",
  "frontend/src/components/KBArticleEditor.tsx": "Form component for creating or editing a knowledge base article, with fields for title, category, body, and tags.",
  "frontend/src/components/KnowledgeBaseView.tsx": "Main knowledge base page supporting search, category filtering, article listing, and navigation to article detail or editor views.",
  "frontend/src/components/LoginPrompt.tsx": "Landing/hero page shown to unauthenticated users, highlighting platform features and providing a CTA to navigate to the customer login page.",
  "frontend/src/components/MainContent.tsx": "Routes authenticated users to either the CustomerDashboard or ExpertDashboard based on their profile's technician status.",
  "frontend/src/components/MetricCard.tsx": "Reusable card component that displays a labeled metric value with an optional icon, subtitle, and trend indicator.",
  "frontend/src/components/OfflineContactForm.tsx": "A form component displayed when all support experts are offline, allowing users to submit their name, email, and message, with a success confirmation state after submission.",
  "frontend/src/components/OpenTicketsByPriorityChart.tsx": "A bar chart component that visualizes open support tickets distributed across Low, Medium, High, and Critical priority levels, derived from the total open ticket count.",
  "frontend/src/components/PaymentSection.tsx": "A payment UI component that initiates a Stripe checkout session for technical support purchases, showing a loading state, a disabled placeholder when Stripe is unconfigured, or a styled payment card when ready.",
  "frontend/src/components/PreChatForm.tsx": "A modal dialog form that collects a user's name, email, and issue topic before starting a support chat session, with inline validation and error display.",
  "frontend/src/components/ProactiveChatInvitation.tsx": "A small popup widget that proactively invites users to start a chat with an online support expert, offering accept and dismiss actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to enter their display name and save a caller profile via the API before accessing support features.",
  "frontend/src/components/ServiceHistoryTimeline.tsx": "Renders a vertical timeline of resolved support tickets, showing ticket ID, resolution date, and optional star rating/comment feedback.",
  "frontend/src/components/SLAIndicator.tsx": "A component that displays a live countdown to an SLA due timestamp, showing warning or breached states based on remaining time, in either compact badge or full row format.",
  "frontend/src/components/TicketCreationForm.tsx": "Form component for creating a new support ticket by selecting a technician and entering title, description, and priority, using a mutation to call the backend actor.",
  "frontend/src/components/TicketDetailView.tsx": "Displays detailed information for a single support ticket and allows technicians to update its status via a dropdown and mutation hook.",
  "frontend/src/components/TicketListView.tsx": "Lists support tickets (user or admin view) with status filtering, and navigates to a detail view by lazy-loading a selected ticket.",
  "frontend/src/components/TicketVolumeChart.tsx": "Renders a line chart of daily ticket volume over the last 30 days using randomly generated mock data scaled to a provided total ticket count.",
  "frontend/src/components/TypingIndicator.tsx": "Simple animated three-dot typing indicator component using staggered bounce animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom hook that fetches analytics metrics (total, open, resolved tickets, resolution rate) from the backend actor, refreshing every 30 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useKnowledgeBase.ts": "Exports React Query hooks for CRUD operations on knowledge base articles, including fetching, searching, creating, updating, deleting, and incrementing view counts.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for user profiles, chat messages, support tickets, shopping items, and login events, with polling for real-time message updates.",
  "frontend/src/hooks/useTickets.ts": "Exports React Query hooks for fetching user and admin support tickets, retrieving a single ticket, and updating ticket status, with periodic refetching.",
  "frontend/src/index.css": "Defines global CSS custom properties for light and dark themes using OKLCH colors, imports Google Fonts, and sets up Tailwind base/component/utility layers.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Poppins), CSS variable-based color tokens, border radii, box shadows, and keyframe animations; includes tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the current state (version 15) of an IT support/helpdesk web app project, listing existing features, architectural notes, known issues (e.g., chat history not visible on customer side), and a flag indicating this is a fix request."
}