{
  "kind": "build_request",
  "title": "Fix history display on customer/expert pages and remove payment option from ticket creation",
  "projectName": "TechSupport Platform",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the payment option (payment field, payment toggle, or any payment-related UI element) from the ticket creation form in the CustomerDashboard so customers cannot set payment details when creating a new ticket.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the payment option while creating the ticket from customer dashboard"
        ]
      },
      "acceptanceCriteria": [
        "The TicketCreationForm component does not render any payment-related fields or toggles.",
        "A new ticket can be created without any payment input.",
        "No payment data is submitted as part of ticket creation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the expert/technician's payment request toggle in the ChatSection so that toggling the payment button opens the payment request popup/modal correctly. The modal must appear when the expert activates the payment toggle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "expert is tryg to send the payment option by toggle button nut pop up is not coming"
        ]
      },
      "acceptanceCriteria": [
        "When the expert clicks the payment toggle in ChatSection, the PaymentRequestModal (or equivalent payment popup) opens.",
        "The modal displays the correct payment details for the active ticket.",
        "Closing or dismissing the modal resets the toggle state appropriately."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the Service History / history tab on the CustomerDashboard (ClientPortal) so that resolved tickets and past interactions are correctly fetched from the backend and displayed. The history list must not be empty when resolved tickets exist.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "customer and expert page are not showing history"
        ]
      },
      "acceptanceCriteria": [
        "The 'Service History' or history tab in the CustomerDashboard renders all resolved tickets associated with the logged-in customer.",
        "The ServiceHistoryTimeline component receives and displays non-empty data when resolved tickets exist in the backend.",
        "Loading and empty states are handled gracefully with appropriate messages."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the history/ticket history section on the ExpertDashboard so that past and resolved tickets handled by the expert are correctly fetched and displayed. The list must not be empty when historical ticket data exists.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "customer and expert page are not showing history"
        ]
      },
      "acceptanceCriteria": [
        "The ExpertDashboard's ticket history section renders resolved or closed tickets assigned to the logged-in technician.",
        "The correct backend query is called (e.g., filtering by technician principal or resolved status) and results are passed to the UI.",
        "Loading and empty states are handled gracefully."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Resolve the deployment error that caused the previous build to fail. Audit the backend Motoko actor (backend/main.mo) and frontend entry files for any compilation or runtime errors, fix type mismatches, missing imports, or malformed function signatures, and ensure the project builds and deploys successfully.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deployment error encountered during build"
        ]
      },
      "acceptanceCriteria": [
        "The backend Motoko actor compiles without errors.",
        "The frontend builds without TypeScript or bundler errors.",
        "The deployed application loads and all routes are accessible."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Keep all backend logic within the single actor in backend/main.mo.",
    "Do not introduce new payment gateways or external services."
  ],
  "nonGoals": [
    "Adding new payment providers or restructuring the payment flow beyond fixing the modal toggle.",
    "Redesigning the dashboard layout or navigation.",
    "Adding new ticket fields or changing the ticket data model beyond what is required for these fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}