{
  "kind": "build_request",
  "title": "Update Expert Profile & Landing Page for Everyday Device Support Focus",
  "projectName": "Caffeine Tech Support",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Update the LoginPrompt (hero/landing) component headline and description to reflect everyday device support: set the headline to 'Tech Support Expert | Fast Fixes for Laptops, Desktops, Mobiles & Printers | 10+ Years Experience' and replace any existing long description with the short copy: 'Jaipur-based pro fixing your laptops, desktops, mobiles, and printers remotely or on-site. Quick, affordable solutions for home/office. Message for same-day help!'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Headline Update: Change to \"Tech Support Expert | Fast Fixes for Laptops, Desktops, Mobiles & Printers | 10+ Years Experience\"",
          "Description Shorten: Limit to 3-4 lines: \"Jaipur-based pro fixing your laptops, desktops, mobiles, and printers remotely or on-site. Quick, affordable solutions for home/office. Message for same-day help!\""
        ]
      },
      "acceptanceCriteria": [
        "The hero/landing page displays the exact headline: 'Tech Support Expert | Fast Fixes for Laptops, Desktops, Mobiles & Printers | 10+ Years Experience'",
        "The description on the landing page is 3–4 lines and matches the specified copy exactly",
        "No references to AWS, cloud, or old headline text remain on the landing page"
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a Skills/Services section to the LoginPrompt landing page listing four bullet-point skills: 'Laptop/Desktop troubleshooting & upgrades', 'Mobile repair/setup (Android/iOS)', 'Printer connectivity & ink issues', 'Remote support via chat/video'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Skills Section: List simple bullets like \"Laptop/Desktop troubleshooting & upgrades, Mobile repair/setup (Android/iOS), Printer connectivity & ink issues, Remote support via chat/video\""
        ]
      },
      "acceptanceCriteria": [
        "A clearly labeled 'Skills' or 'Services' section appears on the landing page",
        "All four bullet items are displayed exactly as specified",
        "No cloud/AWS-related skills appear in this section"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a Pricing/Services section to the LoginPrompt landing page displaying three clear service tiers in INR: 'Basic Diagnostic: ₹500', 'Full Laptop/Mobile Fix: ₹1,500', 'Printer Setup: ₹800'. Each tier should emphasize a 24–48 hour turnaround promise.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pricing/Services: Offer clear tiers, e.g., \"Basic diagnostic: ₹500; Full laptop/mobile fix: ₹1,500; Printer setup: ₹800\" – use INR, emphasize 24-48 hour turnaround."
        ]
      },
      "acceptanceCriteria": [
        "A Pricing or Services section is visible on the landing page with exactly three tiers",
        "All prices are displayed in INR (₹) with the specified amounts",
        "Each tier card/row includes a '24–48 hour turnaround' note"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add a Testimonials section to the LoginPrompt landing page with at least three short client quotes: 'Fixed my printer in 30 mins!', 'Laptop running smooth again', and one additional quote about mobile repair. Display each as a styled testimonial card with attribution.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Testimonials: Include short quotes like \"Fixed my printer in 30 mins!\" or \"Laptop running smooth again\" – add 2-3 even if self-generated for starters."
        ]
      },
      "acceptanceCriteria": [
        "A Testimonials section appears on the landing page with at least 3 testimonial cards",
        "The two specified quotes are present verbatim",
        "Each card includes a quote and a placeholder customer name/attribution"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Add a visuals/icons strip to the LoginPrompt landing page with clean device icons for laptop, mobile phone, and printer, rendered inline to visually reinforce the service categories. Add a banner or hero tagline element reading 'Device Fixes Done Right' using the generated banner image (device-fixes-banner.dim_1200x400.png) and device icons (laptop-icon.dim_64x64.png, phone-icon.dim_64x64.png, printer-icon.dim_64x64.png) served from frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Visuals Refresh: Use clean icons for each device (laptop, phone, printer); add a friendly photo or simple banner saying \"Device Fixes Done Right\"."
        ]
      },
      "acceptanceCriteria": [
        "Three device icons (laptop, phone, printer) are displayed on the landing page",
        "A banner or prominent element shows the text 'Device Fixes Done Right'",
        "All images are loaded from frontend/public/assets/generated"
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add a Portfolio/Work Samples section to the LoginPrompt landing page showcasing 2–3 device fix scenarios. Use the generated portfolio images (printer-setup-before-after.dim_600x400.png, mobile-repair-demo.dim_600x400.png, laptop-fix-demo.dim_600x400.png) served from frontend/public/assets/generated, with short captions describing each scenario (e.g., 'Before/After: Printer Setup', 'Mobile Screen Repair Demo', 'Laptop Upgrade Complete').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Portfolio Additions: Add 2-3 screenshots of fixed devices (e.g., before/after printer setup, mobile screen repair demo) or short video clips of quick fixes."
        ]
      },
      "acceptanceCriteria": [
        "A Portfolio or Work Samples section is visible on the landing page",
        "2–3 image cards are displayed with captions describing each fix scenario",
        "All images are loaded from frontend/public/assets/generated"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ (immutable paths)",
    "Do not modify frontend/src/main.tsx or frontend/src/components/ui (immutable paths)",
    "All prices must be displayed in INR (₹), not USD or any other currency",
    "Do not alter existing backend data models or actor logic"
  ],
  "nonGoals": [
    "Changes to the ticketing system, chat, or knowledge base functionality",
    "Changes to the ExpertDashboard or CustomerDashboard internals",
    "Any backend schema or actor function changes",
    "Removing or modifying existing authentication flows"
  ],
  "imageRequirements": {
    "required": [
      "Wide banner with bold text 'Device Fixes Done Right' on a clean white/light-grey background with subtle tech iconography silhouettes (device-fixes-banner.dim_1200x400.png)",
      "Flat vector illustration of a laptop computer, front-facing, minimal line-art style on transparent background (laptop-icon.dim_64x64.png)",
      "Flat vector illustration of a smartphone, front-facing, minimal line-art style on transparent background (phone-icon.dim_64x64.png)",
      "Flat vector illustration of a desktop inkjet printer, front-facing, minimal line-art style on transparent background (printer-icon.dim_64x64.png)",
      "Side-by-side before/after illustration of a printer setup: left panel showing tangled cables and offline status, right panel showing neat cables and green connected status (printer-setup-before-after.dim_600x400.png)",
      "Illustration of a technician holding a smartphone showing a cracked screen on the left and a repaired screen on the right (mobile-repair-demo.dim_600x400.png)",
      "Illustration of a laptop on a desk showing a performance boost graphic with a speedometer going from slow to fast (laptop-fix-demo.dim_600x400.png)"
    ],
    "edits": []
  }
}