{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix history display on customer/expert pages and remove payment option from ticket creation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the payment option (payment field, payment toggle, or any payment-related UI element) from the ticket creation form in the CustomerDashboard so customers cannot set payment details when creating a new ticket.",
      "acceptanceCriteria": [
        "The TicketCreationForm component does not render any payment-related fields or toggles.",
        "A new ticket can be created without any payment input.",
        "No payment data is submitted as part of ticket creation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TicketCreationForm.tsx",
          "operation": "modify",
          "description": "Remove all payment-related UI elements (fields, toggles, inputs) from the ticket creation form. Ensure the form only collects technician selection, title, description, and priority. Verify that no payment data is included in the createSupportTicket mutation payload."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the expert/technician's payment request toggle in the ChatSection so that toggling the payment button opens the payment request popup/modal correctly. The modal must appear when the expert activates the payment toggle.",
      "acceptanceCriteria": [
        "When the expert clicks the payment toggle in ChatSection, the PaymentRequestModal (or equivalent payment popup) opens.",
        "The modal displays the correct payment details for the active ticket.",
        "Closing or dismissing the modal resets the toggle state appropriately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatSection.tsx",
          "operation": "modify",
          "description": "Fix the payment toggle event handler to correctly open the PaymentRequestModal when the expert activates the toggle. Ensure the modal receives the current ticket ID and payment state. Add proper state management to track modal open/close and reset toggle state when the modal is dismissed without completing payment. Verify the toggle->modal flow using the usePaymentToggle hook."
        },
        {
          "path": "frontend/src/components/PaymentRequestModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal properly receives and displays payment details for the active ticket. Add onClose callback support to notify the parent component when the modal is dismissed, allowing proper toggle state reset. Verify the modal shows correct ticket and payment information when opened from ChatSection."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix the Service History / history tab on the CustomerDashboard (ClientPortal) so that resolved tickets and past interactions are correctly fetched from the backend and displayed. The history list must not be empty when resolved tickets exist.",
      "acceptanceCriteria": [
        "The 'Service History' or history tab in the CustomerDashboard renders all resolved tickets associated with the logged-in customer.",
        "The ServiceHistoryTimeline component receives and displays non-empty data when resolved tickets exist in the backend.",
        "Loading and empty states are handled gracefully with appropriate messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useGetCustomerHistory that calls actor.getCustomerHistory() to fetch resolved tickets for the current customer. Enable the query only when the actor is available and the user is authenticated. Set appropriate staleTime and refetchInterval for real-time updates. Return loading, error, and data states."
        },
        {
          "path": "frontend/src/components/ServiceHistoryTimeline.tsx",
          "operation": "modify",
          "description": "Update the component to use the new useGetCustomerHistory hook instead of relying on props or other data sources. Filter the returned tickets to show only resolved ones (status === 'resolved'). Handle loading state with a skeleton or spinner. Display an appropriate empty state message when no resolved tickets exist. Ensure tickets are sorted by updatedAt timestamp (most recent first) and render feedback ratings and comments correctly."
        },
        {
          "path": "frontend/src/components/ClientPortal.tsx",
          "operation": "modify",
          "description": "Ensure the Service History tab correctly renders the ServiceHistoryTimeline component without passing stale or incorrect props. Verify the tab switch logic and ensure the history data is fetched when the tab becomes active. Add error boundary handling for the history section."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix the history/ticket history section on the ExpertDashboard so that past and resolved tickets handled by the expert are correctly fetched and displayed. The list must not be empty when historical ticket data exists.",
      "acceptanceCriteria": [
        "The ExpertDashboard's ticket history section renders resolved or closed tickets assigned to the logged-in technician.",
        "The correct backend query is called (e.g., filtering by technician principal or resolved status) and results are passed to the UI.",
        "Loading and empty states are handled gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useGetExpertHistory that calls actor.getExpertHistory() to fetch resolved tickets assigned to the current technician. Enable the query only when the actor is available, the user is authenticated, and the user profile indicates isTechnician is true. Set appropriate staleTime and refetchInterval. Return loading, error, and data states."
        },
        {
          "path": "frontend/src/components/ExpertDashboard.tsx",
          "operation": "modify",
          "description": "Add a ticket history section or tab that uses the new useGetExpertHistory hook to fetch and display resolved tickets for the logged-in technician. Render the ticket list with appropriate metadata (ticket ID, customer, resolved date, status). Handle loading state with a skeleton or spinner and display an empty state message when no historical tickets exist. Ensure tickets are sorted by updatedAt (most recent first). Wire the history section into the existing tab navigation if not already present."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Resolve the deployment error that caused the previous build to fail. Audit the frontend entry files for any compilation or runtime errors, fix type mismatches, missing imports, or malformed function signatures, and ensure the project builds successfully.",
      "acceptanceCriteria": [
        "The frontend builds without TypeScript or bundler errors.",
        "The deployed application loads and all routes are accessible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the App.tsx file for any TypeScript errors, missing imports, or route configuration issues. Verify all route components are correctly imported and typed. Check for any undefined references or type mismatches in the router setup. Ensure QueryClientProvider, ThemeProvider, and InternetIdentityProvider are correctly configured and wrapped."
        },
        {
          "path": "frontend/src/components/CustomerDashboard.tsx",
          "operation": "modify",
          "description": "Audit for TypeScript compilation errors, missing prop types, incorrect hook usage, or malformed JSX. Verify all child components (ChatSection, ClientPortal, KnowledgeBaseView, PaymentSection, PaymentModalController) are correctly imported and used. Fix any type mismatches in state variables, event handlers, or component props. Ensure the PaymentModalController polling logic does not cause runtime errors."
        },
        {
          "path": "frontend/src/components/ExpertDashboard.tsx",
          "operation": "modify",
          "description": "Audit for TypeScript errors, missing imports, or incorrect component usage. Verify all tab sections (ChatSection, TicketListView, AnalyticsDashboard, KnowledgeBaseView, AdminLoginTracking) are correctly imported and rendered. Fix any type mismatches in props or state. Ensure tab navigation logic is correct and does not cause runtime errors."
        },
        {
          "path": "frontend/src/components/ChatSection.tsx",
          "operation": "modify",
          "description": "Audit for TypeScript errors, missing imports, type mismatches in hook usage (usePaymentToggle, useTickets, useSendMessage), or incorrect prop types. Verify all event handlers, state updates, and optimistic UI logic are correctly typed. Fix any issues with the payment toggle logic that may cause compilation or runtime errors. Ensure the component does not have any undefined references or malformed JSX."
        },
        {
          "path": "frontend/src/hooks/usePaymentToggle.ts",
          "operation": "modify",
          "description": "Audit the usePaymentToggle hooks for TypeScript errors, incorrect return types, or missing actor method calls. Verify the polling configuration (refetchInterval: 5000) does not cause runtime issues. Fix any type mismatches in the mutation payload or query keys. Ensure the hooks correctly handle null actor or unauthenticated states."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit all query hooks for TypeScript errors, missing return type annotations, incorrect actor method calls, or type mismatches. Verify enabled conditions, query keys, and queryFn implementations are correct. Fix any issues with aggressive polling that may cause performance or runtime problems. Ensure all hooks handle null actor states gracefully."
        },
        {
          "path": "frontend/src/hooks/useTickets.ts",
          "operation": "modify",
          "description": "Audit the ticket-related hooks for TypeScript errors, incorrect return types, or missing actor method calls. Verify query keys, enabled conditions, and mutation logic are correct. Fix any type mismatches or runtime errors in the updateTicketStatus mutation. Ensure polling configurations do not cause performance issues."
        }
      ]
    }
  ]
}