{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix customer chat history visibility, enable customer replies, and remove payment gate from ticket creation",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Fix ChatSection component so customers can see full chat message history for their active support sessions",
      "acceptanceCriteria": [
        "When a customer opens a chat session tied to a ticket, all previous messages (both customer and technician messages) are visible in the chat window.",
        "Messages are displayed in chronological order with correct sender attribution.",
        "The chat history persists across page refreshes for the customer.",
        "No console errors related to message fetching or principal filtering appear on the customer side."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatSection.tsx",
          "operation": "modify",
          "description": "Fix the getChatMessages query to properly fetch and display all chat messages for customers. Debug and resolve any principal mismatch issues in the useQuery call that fetches messages from the backend. Ensure the messages query is enabled when a ticket is selected and properly filters messages by ticketId. Verify that the message list renders all fetched messages in chronological order with correct sender attribution (customer vs technician). Add error handling and loading states to surface any query failures to the user. Ensure the chat history persists across page refreshes by relying on React Query's caching behavior."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Fix ChatSection component so customers can type and send reply messages in active chat sessions",
      "acceptanceCriteria": [
        "The chat message input field is visible and editable for authenticated customers.",
        "The send button is enabled and submits the customer's message to the backend successfully.",
        "After sending, the new message appears in the chat thread without requiring a manual refresh.",
        "Customers cannot send messages to sessions that do not belong to them.",
        "No permission errors or silent failures occur when a customer submits a message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatSection.tsx",
          "operation": "modify",
          "description": "Fix the message input and send functionality for customers. Ensure the message input field and send button are rendered and functional for customers (not just technicians). Debug and resolve any role-check or conditional rendering issues that hide the input controls from customers. Verify that the sendMessageForTicket mutation is called correctly with the selected ticketId and message content. Add proper error handling and toast notifications for successful message submission or failures. Ensure the chat messages list automatically updates after sending a new message by invalidating the relevant React Query cache. Prevent customers from sending messages to tickets that don't belong to them by validating ownership before submission."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useSendMessageForTicket mutation hook to ensure it properly calls the backend actor's sendMessageForTicket function and handles both success and error responses. Ensure proper cache invalidation occurs after a successful message send to trigger an immediate UI update. Add appropriate error handling and user feedback for permission errors or silent failures."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Remove all payment gate checks from ticket creation flow in ClientPortal and TicketCreationForm",
      "acceptanceCriteria": [
        "The 'Create Ticket' button in ClientPortal is visible and clickable for all authenticated customers regardless of payment/plan status.",
        "No payment prompt, paywall dialog, or plan-upgrade message appears before or during ticket creation.",
        "Submitting the ticket creation form successfully creates a ticket in the backend and shows it in the customer's ticket list.",
        "Removing the payment gate does not break any other payment-related features (PaymentSection, service plans)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientPortal.tsx",
          "operation": "modify",
          "description": "Remove all payment gate checks that conditionally render or disable the 'Create Ticket' button. Delete any code that checks for payment plan validation, subscription status, or Stripe/Razorpay verification before allowing users to open the ticket creation dialog. Ensure the ticket creation dialog is unconditionally accessible to any authenticated customer. Preserve all other payment-related UI elements and functionality (PaymentSection display, service plan browsing) without modification."
        },
        {
          "path": "frontend/src/components/TicketCreationForm.tsx",
          "operation": "modify",
          "description": "Remove any payment status checks, plan verification logic, or subscription validation that blocks ticket submission. Ensure the form submission handler directly calls the createSupportTicket mutation without any payment-related pre-checks. Verify that successful ticket creation updates the user's ticket list and closes the dialog. Preserve proper error handling for invalid form data or backend failures unrelated to payments."
        }
      ]
    }
  ]
}